{
  "backend/main.mo": "Minimal Motoko canister actor with no methods implemented.",
  "feature_evidence.json": "Feature evidence report listing UI/UX update tasks, related files, components, and test IDs for two major styling features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling of all major frontend files and components.",
  "frontend/index.css": "Defines Tailwind layers and extensive OKLCH-based design tokens for light/dark modes with global border and background rules.",
  "frontend/index.html": "Base HTML document that sets metadata and loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Composes the full single‑page marketing site layout with header, all sections, and footer.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "About section describing the agency and rendering a grid of value cards inside a reusable section shell.",
  "frontend/src/components/marketing/sections/CtaSection.tsx": "Marketing CTA section with email form submission and support/guarantee stats.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Hero section with marketing pitch, scroll actions, trust indicators, and visual stats cards.",
  "frontend/src/components/marketing/sections/LegalSections.tsx": "Renders privacy policy content sections with headings, dates, and detailed legal text.",
  "frontend/src/components/marketing/sections/ProcessSection.tsx": "Displays a four-step marketing process using cards with icons, titles, and descriptions.",
  "frontend/src/components/marketing/sections/ProofSection.tsx": "Shows key business metrics with icons to highlight credibility and performance.",
  "frontend/src/components/marketing/sections/SectionShell.tsx": "Reusable layout wrapper applying background variants and container styling for sections.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Lists service offerings with icons, descriptions, feature lists, and CTA to contact section.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Displays client testimonials with ratings, quotes, and avatar info.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Footer component with brand block, link groups, social icons, and attribution using Vercel-inspired neutral styling.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Sticky responsive header with scroll-aware styling, navigation buttons, and a mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Provides a hook that creates a backend actor based on the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks tied to backend methods.",
  "frontend/src/index.css": "Defines global Tailwind-based styling, custom CSS variables, typography rules, and utility classes for the UI theme.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, color tokens, plugins, and design extensions for the project.",
  "project_state.json": "Describes the project's current state, goals, requirements, known issues, and planned frontend/UI revamp features."
}