{
  "backend/main.mo": "Empty Motoko actor with no functions or logic.",
  "feature_evidence.json": "Feature evidence report listing implemented marketing-site features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries for all frontend source files.",
  "frontend/index.css": "Tailwind setup defining root OKLCH color tokens, dark mode variables, and base background/text styles.",
  "frontend/index.html": "Main HTML shell defining metadata, root mount point, and script entry for the React app.",
  "frontend/src/App.tsx": "Top-level React component composing all marketing sections along with header and footer.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "About section describing the agency’s background and listing four core values in card layout.",
  "frontend/src/components/marketing/sections/CtaSection.tsx": "CTA section with an email capture form, styled content, and trust indicators.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Hero banner with marketing copy, scroll actions, trust indicators, and visual stats.",
  "frontend/src/components/marketing/sections/LegalSections.tsx": "Renders the privacy policy section including dated notice and detailed policy content.",
  "frontend/src/components/marketing/sections/ProcessSection.tsx": "Displays a four-step marketing process using styled cards and descriptive text.",
  "frontend/src/components/marketing/sections/ProofSection.tsx": "Shows key business metrics with icons to highlight credibility and achievements.",
  "frontend/src/components/marketing/sections/SectionShell.tsx": "Wrapper component that applies variant-based section styling and layout.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Service listing section with cards detailing offerings, features, and a scroll-to-contact action.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Renders a testimonials section with cards, star ratings, avatars, and text using static testimonial data.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Footer component showing brand info, service/company/legal links, social icons, and attribution.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Sticky header with scroll-based styling, navigation items, mobile sheet menu, and CTA buttons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks when backend methods are added.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, typography, utilities, and custom components for layout and UI effects.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color mappings to CSS variables, and plugin usage.",
  "project_state.json": "Stores project metadata, current feature requirements, known issues, and the overall UI/UX revamp goals."
}