{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose and design style of various frontend files and components.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and global theme tokens for light and dark modes.",
  "frontend/index.html": "Base HTML document setting metadata and loading the React application root.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps all pages with a shared header and footer layout.",
  "frontend/src/components/layout/PageShell.tsx": "Generic page wrapper component providing layout, titles, and optional narrow or centered formatting.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "Renders an about section with agency background details and a grid of core values displayed as cards. Uses SectionShell for layout and lucide-react icons for value items.",
  "frontend/src/components/marketing/sections/CtaSection.tsx": "Implements a call‑to‑action block with an email signup form, promotional text, and business guarantees. Handles simple form submission via local state.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Displays the hero area with headline, CTAs, trust indicators, and a visual stats card layout. Includes scrolling handlers to navigate to contact and services sections.",
  "frontend/src/components/marketing/sections/LegalSections.tsx": "Provides structured legal content including a privacy policy with headings, sections, and lists. Uses SectionShell for layout and renders dynamically dated update text.",
  "frontend/src/components/marketing/sections/ProcessSection.tsx": "Shows a four‑step workflow using cards with icons, numbers, and descriptions. Presented in a responsive grid inside a SectionShell wrapper.",
  "frontend/src/components/marketing/sections/ProofSection.tsx": "Displays key business metrics with icons, values, and short descriptions in a grid. Emphasizes social proof and company achievements.",
  "frontend/src/components/marketing/sections/SectionShell.tsx": "A wrapper component applying background variants and layout classes to marketing sections. Accepts children, variant, id, and className for flexible section styling.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Renders a service catalog with cards listing descriptions and feature bullets for each offering. Includes a scroll-to-contact handler and uses SectionShell for structure.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Renders a testimonials section showing client quotes, ratings, and avatars using cards in a grid layout.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Responsive footer with navigation links, branding, social icons, and sectioned content.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Sticky responsive header with navigation, scroll styling, mobile menu, and call‑to‑action buttons.",
  "frontend/src/components/portfolio/CaseStudyCard.tsx": "Displays a clickable case study card with image, industry badge, summary text, and key outcome metrics.",
  "frontend/src/content/blogPosts.ts": "Exports an array of blog post metadata including slugs, titles, excerpts, authors, dates, categories, and read times.",
  "frontend/src/content/caseStudies.ts": "Defines detailed case study data with challenges, approaches, outcomes, services, and testimonials for multiple projects.",
  "frontend/src/content/companyPages.ts": "Provides structured company page content including mission, values, services, stats, industries, and certifications.",
  "frontend/src/content/legalPolicies.ts": "Contains privacy and cookie policy content with sections describing data practices, rights, and compliance details.",
  "frontend/src/content/reviews.ts": "Exports an array of detailed client review objects with quotes, outcomes, and project info.",
  "frontend/src/content/services.ts": "Defines a list of service descriptions including deliverables, processes, outcomes, and related services.",
  "frontend/src/content/siteCopy.ts": "Provides marketing copy for hero, proof metrics, and CTA sections of the site.",
  "frontend/src/content/types.ts": "Declares TypeScript interfaces for case studies, services, blog posts, and reviews.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for authentication, exposing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current implementation.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, typography, and utility classes for styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge to merge class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, loading global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page using company content to display mission, values, team, approach, and a contact CTA.",
  "frontend/src/pages/AmsDigitalProfilePage.tsx": "Shows the company's profile including services, stats, industries, and certifications from structured content.",
  "frontend/src/pages/BlogsPage.tsx": "Lists blog posts with category, date, read time, excerpt, and author in a responsive card grid.",
  "frontend/src/pages/CaseStudyDetailPage.tsx": "Displays a detailed case study page with hero info, metrics, challenge, approach, outcome, and navigation back to the portfolio.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with client-side submission feedback and fields for user inquiries.",
  "frontend/src/pages/CookiePolicyPage.tsx": "Renders the cookie policy with sections sourced from legal content.",
  "frontend/src/pages/CustomerReviewsPage.tsx": "Shows customer reviews with ratings, quotes, outcomes, and client details.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero content, proof metrics, featured case studies, and calls to action.",
  "frontend/src/pages/PortfolioPage.tsx": "Displays all case studies in a grid using CaseStudyCard components.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page by displaying policy metadata and looping through sections in styled cards. Uses PageShell layout and content from legalPolicies.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays a detailed view of a selected service, including overview, deliverables, process steps, and outcomes, with category-based styling. Handles missing services and navigation back to the listing.",
  "frontend/src/pages/ServicesPage.tsx": "Shows categorized lists of services with cards that link to individual service detail pages. Uses PageShell layout and dynamic filtering by service category.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom theming, color tokens, container settings, extended utilities, and animation keyframes. Includes typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project’s state, goals, features, and image requirements for building an AMS Digital–style marketing site. Tracks requirements, architecture notes, and versioning."
}