{
  "kind": "build_request",
  "title": "Update marketing site UI/UX to match Vercel.com visual style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the UI/UX reference target from https://seosherpa.com/ to https://vercel.com/ and restyle the existing AMS Digital Agency single-page marketing site to closely match Vercel’s visual style and interaction patterns (layout density, typography, color system, borders, shadows, hover/focus states, and overall polish) while keeping all existing section structure and AMS Digital Agency branding/content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "use ui like https://vercel.com/"
        ]
      },
      "acceptanceCriteria": [
        "The site’s overall look and feel is recognizably Vercel-inspired: neutral/monochrome palette, crisp borders/dividers, subtle elevation, and restrained accent usage (no bright gradient-forward brand styling as the primary motif).",
        "No new product features or new pages are introduced; only styling/UX is changed across existing sections (Header, Hero, Services, Proof, Testimonials, Process, About, CTA, Legal, Footer).",
        "All existing navigation/footer anchor links (#services, #process, #testimonials, #about, #contact, #privacy, #terms, #cookies) continue to work and scroll smoothly.",
        "All user-facing text remains professional English and retains AMS Digital Agency meaning (do not replace with Vercel product copy)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement Vercel-like component-level styling updates across the marketing UI by adjusting the design tokens and section/component compositions (e.g., global theme variables, container/spacing utilities, and section shells) to achieve a clean, high-contrast, grid-and-divider-forward aesthetic that works in both light and dark modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "use ui like https://vercel.com/"
        ]
      },
      "acceptanceCriteria": [
        "Global theme variables and base styles (e.g., in frontend/src/index.css) are updated to a Vercel-like neutral palette with clear semantic contrast for text, borders, and surfaces.",
        "Header, buttons, badges, cards, and section wrappers exhibit consistent Vercel-like styling: minimal rounding, subtle shadows (or none), thin borders, and refined hover/focus states.",
        "The Hero section’s visual treatment is updated away from colorful gradients toward a Vercel-like restrained treatment (e.g., subtle grid/background texture and clean panels) while keeping existing content and CTAs.",
        "No edits are made to any immutable UI component source files under frontend/src/components/ui or other listed immutablePaths; changes are achieved via composition and styling in editable files."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under the frontend immutable paths (including frontend/src/components/ui and the Internet Identity/actor hooks listed as immutable).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this UI refresh.",
    "Do not introduce unrelated product features; this request is a visual/UX restyle to match https://vercel.com/."
  ],
  "nonGoals": [
    "Adding a blog, CMS, or new site sections not already present in App.tsx.",
    "Adding authentication changes, backend methods, or persistence (backend/main.mo can remain empty).",
    "Integrating third-party services or APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}