{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Vercel-inspired restyle of AMS Digital Agency single-page marketing site (light/dark)",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Restyle the existing marketing single-page UI to be recognizably Vercel-inspired while keeping all existing sections, branding/content, and working anchor navigation.",
      "acceptanceCriteria": [
        "The site’s overall look and feel is recognizably Vercel-inspired: neutral/monochrome palette, crisp borders/dividers, subtle elevation, and restrained accent usage (no bright gradient-forward brand styling as the primary motif).",
        "No new product features or new pages are introduced; only styling/UX is changed across existing sections (Header, Hero, Services, Proof, Testimonials, Process, About, CTA, Legal, Footer).",
        "All existing navigation/footer anchor links (#services, #process, #testimonials, #about, #contact, #privacy, #terms, #cookies) continue to work and scroll smoothly.",
        "All user-facing text remains professional English and retains AMS Digital Agency meaning (do not replace with Vercel product copy)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global base styles to a Vercel-like visual baseline: monochrome surfaces, crisp borders/dividers, restrained accent color, refined focus rings, and smooth-scrolling behavior for all in-page anchors. Ensure changes are purely styling/UX and keep all existing content/section structure. Use shadcn-ui tokens as the source of truth for component styling consistency; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Align any duplicate/global Tailwind token definitions with the Vercel-like neutral palette so the marketing pages render consistently in light/dark modes across environments. Keep this limited to styling; do not introduce new pages/features. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/SectionShell.tsx",
          "operation": "modify",
          "description": "Adjust section wrapper styling to be divider/grid-forward and navigation-friendly: add consistent scroll margin for sticky header offset, unify section background treatments to neutral panels, and support subtle top/bottom dividers between sections without changing section order or IDs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/SiteHeader.tsx",
          "operation": "modify",
          "description": "Restyle header to a Vercel-like sticky topbar: minimal rounding, thin border, subtle backdrop blur, refined hover/focus states, and remove gradient-forward logo treatments in favor of crisp monochrome/neutral branding. Preserve existing nav items and smooth scrolling behavior for #services/#process/#testimonials/#about/#contact. Uses shadcn-ui Button/Sheet; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Update Hero visuals away from colorful gradients toward a restrained Vercel-like treatment: subtle grid/texture background, clean panels, high-contrast typography, and minimal accent usage while keeping the existing hero copy and CTAs. Uses shadcn-ui Button/Badge; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/ServicesSection.tsx",
          "operation": "modify",
          "description": "Restyle Services cards/icons to match Vercel-like density and polish: neutral surfaces, thin borders, minimal rounding, subtle hover states, and consistent typography. Keep the same services content and #services anchor. Uses shadcn-ui Card/Button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/ProofSection.tsx",
          "operation": "modify",
          "description": "Restyle Proof metrics to Vercel-like minimalist stat blocks: remove gradient text/icon backgrounds, introduce divider/grid-aligned layout, and ensure high contrast in both themes. Preserve metric content and section placement. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/TestimonialsSection.tsx",
          "operation": "modify",
          "description": "Restyle Testimonials cards to a Vercel-like clean card system: thin borders, subtle elevation (or none), refined spacing, and muted secondary text. Keep the same testimonials and #testimonials anchor. Uses shadcn-ui Card/Avatar; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/ProcessSection.tsx",
          "operation": "modify",
          "description": "Restyle Process step cards to the same Vercel-like system (panels + dividers, minimal rounding, subtle hover/focus) and reduce decorative gradient-heavy elements while preserving all step text and #process anchor. Uses shadcn-ui Card; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Restyle About section and value cards to a neutral, crisp, Vercel-like presentation (monochrome panels, thin borders, consistent icon treatment) while keeping all text intact and #about anchor unchanged. Uses shadcn-ui Card; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/CtaSection.tsx",
          "operation": "modify",
          "description": "Restyle CTA section away from bold gradients toward a Vercel-like high-contrast panel (e.g., clean dark panel in dark mode / subtle panel in light mode), with refined input/button styling and consistent focus rings. Keep existing CTA copy/form behavior and #contact anchor. Uses shadcn-ui Button/Input; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/LegalSections.tsx",
          "operation": "modify",
          "description": "Refine Legal section typography and layout to match Vercel-like documentation styling: improved type scale, spacing, divider treatment, and readable prose in light/dark, while keeping all legal content and #privacy/#terms/#cookies anchors intact. Uses shadcn-ui Separator; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/SiteFooter.tsx",
          "operation": "modify",
          "description": "Restyle footer to a Vercel-like footer system: neutral background, thin top divider, subdued link styling with crisp hover/focus, and remove gradient-forward brand mark styling while keeping existing links (#services/#process/#testimonials/#about/#contact/#privacy/#terms/#cookies) and footer text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement Vercel-like component-level styling via design tokens, utilities, and section compositions for a clean high-contrast grid/divider-forward aesthetic in light and dark modes without editing immutable UI component sources.",
      "acceptanceCriteria": [
        "Global theme variables and base styles (e.g., in frontend/src/index.css) are updated to a Vercel-like neutral palette with clear semantic contrast for text, borders, and surfaces.",
        "Header, buttons, badges, cards, and section wrappers exhibit consistent Vercel-like styling: minimal rounding, subtle shadows (or none), thin borders, and refined hover/focus states.",
        "The Hero section’s visual treatment is updated away from colorful gradients toward a Vercel-like restrained treatment (e.g., subtle grid/background texture and clean panels) while keeping existing content and CTAs.",
        "No edits are made to any immutable UI component source files under frontend/src/components/ui or other listed immutablePaths; changes are achieved via composition and styling in editable files."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme extensions to support Vercel-like styling primitives (e.g., subtler shadow scale, tighter radius via --radius, and reusable neutral grid/texture background utilities) while continuing to map colors to CSS variables for light/dark. Do not modify any immutable UI component source. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update design tokens (CSS variables) and base typography to a Vercel-like neutral system, including: smaller radius, crisper border contrast, restrained accent, and refined focus-visible states. Replace gradient-forward helper utilities (e.g., gradient-text/hover-lift) with Vercel-like equivalents (subtle hover, minimal elevation) while keeping usage limited to editable marketing components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/SectionShell.tsx",
          "operation": "modify",
          "description": "Evolve SectionShell into a consistent section composition primitive (shell + container + divider rules) that marketing sections can share to achieve grid-and-divider-forward aesthetics in both themes, without touching frontend/src/components/ui internals. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/SiteHeader.tsx",
          "operation": "modify",
          "description": "Ensure header interactive states (hover/focus/active) match updated global tokens and Vercel-like restraint, relying on shadcn-ui component props/classes (no edits under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/marketing/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Apply the new section shell + token system to the Hero composition (background texture/panels, button/badge styling, spacing density) to meet Vercel-like standards while keeping content unchanged. Uses shadcn-ui Badge/Button; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}